crownstone/nRF5-SDK-for-Mesh/mesh/core/src/net_state.c
/* Copyright (c) 2010 - 2019, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "net_state.h"
#include "timer.h"
#include "timer_scheduler.h"
#include "bearer_event.h"
#include "nrf_mesh_assert.h"
#include "nrf_mesh_events.h"
#include "nrf_mesh_config_core.h"
#include "toolchain.h"
#include "event.h"
#include "flash_manager.h"

#include <string.h>

/*****************************************************************************
* Local defines
*****************************************************************************/

#define NETWORK_IV_UPDATE_TIMER_INTERVAL_US     (60000000) /**< 60 seconds. */

/** Longest time we're allowed to stay in an IV update state */
#define NETWORK_MAX_IV_UPDATE_INTERVAL_MINUTES  (144 * 60)
/** The minimum time between IV Recovery, in minutes. */
#define NETWORK_MIN_IV_RECOVERY_INTERVAL_MINUTES  (192 * 60)
/** Margin to ensure we're inside of the Mesh Profile Specification v1.0 time limits */
#define NETWORK_IV_UPDATE_TIME_MARGIN_MINUTES   (10)

/** Maximum clock drift possible, according to Bluetooth Core Specification v4.0 (500ppm). */
#define MAX_CLOCK_DRIFT(T)  ((T) / 2000 + 1)

#define IV_UPDATE_TIMEOUT (NETWORK_MIN_IV_UPDATE_INTERVAL_MINUTES + \
                           MAX_CLOCK_DRIFT(NETWORK_MIN_IV_UPDATE_INTERVAL_MINUTES))

#define IV_RECOVERY_TIMEOUT (NETWORK_MIN_IV_RECOVERY_INTERVAL_MINUTES + \
                           MAX_CLOCK_DRIFT(NETWORK_MIN_IV_RECOVERY_INTERVAL_MINUTES))

#define IV_UPDATE_IN_PROGRESS_MAX_TIME (NETWORK_MAX_IV_UPDATE_INTERVAL_MINUTES - \
                                        MAX_CLOCK_DRIFT(NETWORK_MAX_IV_UPDATE_INTERVAL_MINUTES) - \
                                        NETWORK_IV_UPDATE_TIME_MARGIN_MINUTES)

#define FLASH_HANDLE_SEQNUM         (0x0001)
#define FLASH_HANDLE_IV_INDEX       (0x0002)


#define SEQNUM_INVALID              (0xFFFFFFFF)
#define SEQNUM_MASK                 (NETWORK_SEQNUM_MAX)

#if PERSISTENT_STORAGE || MESH_EXTERNAL_PERSISTENT_STORAGE
    #define RESET_SEQNUM_MAX() (m_net_state.seqnum_max_available = 0)
#else
    #define RESET_SEQNUM_MAX() (m_net_state.seqnum_max_available = NETWORK_SEQNUM_MAX + 1)
#endif

/*****************************************************************************
* Local typedefs
*****************************************************************************/

/** Device network state */
typedef struct
{
    uint32_t seqnum; /**< Sequence number. */
    uint32_t seqnum_max_available; /**< The highest sequence number available for use. */
    uint32_t iv_index; /**< IV index. */
    // bool     key_refresh;               /**< Whether or not we're in key refresh. */
    struct
    {
        net_state_iv_update_t state;   /**< IV update state. */
        bool pending; /**< An IV update state change has been triggered, awaiting timer. */
        bool locked; /**< Changes to IV index or update state has been locked by an external module. */
        uint16_t timeout_counter; /**< Counter for IV update procedure timeout, in minutes. */
        uint16_t ivr_timeout_counter; /**< Counter for IV recovery procedure timeout, in minutes. */
    } iv_update;
} network_state_t;

/*****************************************************************************
* Static globals
*****************************************************************************/
/** Current network state */
static network_state_t m_net_state;
/** IV update timer used to trigger IV update states. */
static timer_event_t m_iv_update_timer;
/** IV update test mode state */
static bool m_test_mode;
static bool m_enabled;
static bool m_iv_state_set;

static nrf_mesh_evt_handler_t m_mesh_evt_handler;

#if MESH_EXTERNAL_PERSISTENT_STORAGE
static net_state_storage_write m_storage_write_cb = NULL;
static net_state_storage_read  m_storage_read_cb  = NULL;
static net_state_storage_erase m_storage_erase_cb = NULL;
#endif

/*****************************************************************************
* Static functions
*****************************************************************************/
static void seqnum_block_allocate(void);
static void flash_store_iv_index(void);

static inline bool iv_timeout_limit_passed(uint32_t timeout)
{
    return (timeout >= IV_UPDATE_TIMEOUT || m_test_mode);
}

