crownstone/nRF5-SDK-for-Mesh/mesh/core/src/net_state.c
/* Notify user of the new IV index. */
static void iv_index_notify(const uint8_t * p_network_id)
{
    nrf_mesh_evt_t app_event;
    if (m_net_state.iv_update.state == NET_STATE_IV_UPDATE_IN_PROGRESS)
    {
        app_event.params.iv_update.iv_index = m_net_state.iv_index - 1;
    }
    else
    {
        app_event.params.iv_update.iv_index = m_net_state.iv_index;
    }
    app_event.params.iv_update.state = m_net_state.iv_update.state;
    app_event.params.iv_update.p_network_id = p_network_id;
    app_event.type = NRF_MESH_EVT_IV_UPDATE_NOTIFICATION;
    event_handle(&app_event);
}

/** Trigger any pending IV update state transitions, if the state is unlocked. */
static bool iv_update_trigger_if_pending(void)
{
    bearer_event_critical_section_begin();

    bool pending = (m_net_state.iv_update.pending && !m_net_state.iv_update.locked &&
                    iv_timeout_limit_passed(m_net_state.iv_update.timeout_counter));

    if (pending)
    {

        m_net_state.iv_update.pending = false;
        switch (m_net_state.iv_update.state)
        {
            case NET_STATE_IV_UPDATE_NORMAL:
                NRF_MESH_ASSERT(net_state_iv_update_start() == NRF_SUCCESS);
                break;
            case NET_STATE_IV_UPDATE_IN_PROGRESS:
                m_net_state.seqnum = 0;
                RESET_SEQNUM_MAX();
                m_net_state.iv_update.state = NET_STATE_IV_UPDATE_NORMAL;
                m_net_state.iv_update.timeout_counter = 0;
                iv_index_notify(NULL);
                flash_store_iv_index();
                seqnum_block_allocate();
                break;
            default:
                NRF_MESH_ASSERT(0); /* Unimplemented state. */
        }
    }
    bearer_event_critical_section_end();
    return pending;
}

static void iv_update_timer_handler(timestamp_t timestamp, void * p_context)
{
    bool increment_counter = true;
    switch (m_net_state.iv_update.state)
    {
        case NET_STATE_IV_UPDATE_NORMAL:
            if (iv_timeout_limit_passed(m_net_state.iv_update.timeout_counter))
            {
                /* We've spent enough time in normal state, may transition to
                 * in progress at any time. */
                (void) iv_update_trigger_if_pending();
                increment_counter = false;
            }
            break;
        case NET_STATE_IV_UPDATE_IN_PROGRESS:
            if (iv_timeout_limit_passed(m_net_state.iv_update.timeout_counter))
            {
                /* We've spent enough time in progress - may now transition to
                 * normal state at any time. */
                if (m_net_state.iv_update.timeout_counter >= IV_UPDATE_IN_PROGRESS_MAX_TIME)
                {
                    /* Force the move to normal state, as we're not allowed to
                     * stay in progress for any longer. */
                    m_net_state.iv_update.pending = true;
                    increment_counter = false;
                }
                (void) iv_update_trigger_if_pending();
            }
            break;
        default:
            NRF_MESH_ASSERT(0); /* Unimplemented state */
    }
    if (increment_counter)
    {
        m_net_state.iv_update.timeout_counter++;
    }

    if (m_net_state.iv_update.ivr_timeout_counter > 0)
    {
        m_net_state.iv_update.ivr_timeout_counter--;
    }
}

static void incoming_data_received(const uint8_t * p_network_id, uint32_t iv_index, bool iv_update, bool key_refresh)
{
    if (m_net_state.iv_update.state == NET_STATE_IV_UPDATE_NORMAL)
    {
        if (m_net_state.iv_update.ivr_timeout_counter == 0 &&
            ((!iv_update && iv_index > m_net_state.iv_index) ||
             (iv_update && iv_index > m_net_state.iv_index + 1)))
        {
            if (iv_index <= (m_net_state.iv_index + NETWORK_IV_RECOVERY_LIMIT) &&
                !m_net_state.iv_update.locked)
            {
                /* We've fallen behind on IV indexes, and should silently
                 * adopt the other, higher IV index. */
                m_net_state.iv_index = iv_index;
                m_net_state.seqnum = 0;
                RESET_SEQNUM_MAX();
                m_net_state.iv_update.timeout_counter = 0;
                m_net_state.iv_update.ivr_timeout_counter = IV_RECOVERY_TIMEOUT;
                m_net_state.iv_update.pending = false;
                m_net_state.iv_update.state = NET_STATE_IV_UPDATE_NORMAL;
                flash_store_iv_index();
                seqnum_block_allocate();
                iv_index_notify(p_network_id);
            }
        }
        else if (iv_update && iv_index == m_net_state.iv_index + 1)
        {
            m_net_state.iv_update.pending = true;
            (void) iv_update_trigger_if_pending();
        }
    }
    else if (m_net_state.iv_update.state == NET_STATE_IV_UPDATE_IN_PROGRESS)
    {
        if (!iv_update && iv_index == m_net_state.iv_index)
        {
            m_net_state.iv_update.pending = true;
            (void) iv_update_trigger_if_pending();
        }
    }
}

static void mesh_evt_handler(const nrf_mesh_evt_t * p_evt)
{
    if (p_evt->type == NRF_MESH_EVT_NET_BEACON_RECEIVED &&
        p_evt->params.net_beacon.p_beacon_info->iv_update_permitted)
    {
        incoming_data_received(p_evt->params.net_beacon.p_beacon_secmat->net_id,
                               p_evt->params.net_beacon.iv_index,
                               (p_evt->params.net_beacon.flags.iv_update == NET_STATE_IV_UPDATE_IN_PROGRESS),
                               p_evt->params.net_beacon.flags.key_refresh);
    }
#if MESH_FEATURE_LPN_ENABLED
    else if (p_evt->type == NRF_MESH_EVT_LPN_FRIEND_UPDATE)
    {
        incoming_data_received(NULL,
                               p_evt->params.friend_update.iv_index,
                               p_evt->params.friend_update.iv_update_active,
                               p_evt->params.friend_update.key_refresh_in_phase2);
    }
#endif
}
/*****************************************************************************
* FLASH MANAGER CODE
*****************************************************************************/

#if PERSISTENT_STORAGE || MESH_EXTERNAL_PERSISTENT_STORAGE
typedef struct
{
    uint32_t iv_index;
    uint8_t iv_update_in_progress;
} net_flash_data_iv_index_t;

typedef uint32_t net_flash_data_sequence_number_t;

typedef struct
{
    const net_flash_data_iv_index_t * p_iv_index_data;
    const net_flash_data_sequence_number_t * p_seqnum_data;
} entry_recover_context_t;

#if MESH_EXTERNAL_PERSISTENT_STORAGE != 1
/** Flash manager handling Network state flash storage. */
static flash_manager_t m_flash_manager;
#endif
static bool m_seqnum_allocation_in_progress;
#if MESH_EXTERNAL_PERSISTENT_STORAGE != 1
/** Flash operation function to call when the memory returns. */
typedef void (*flash_op_func_t)(void);

static void flash_mem_available(void * p_args)
{
    NRF_MESH_ASSERT(p_args != NULL);
    flash_op_func_t func = (flash_op_func_t) p_args; /*lint !e611 Suspicious cast */
    func();
}
#endif

static void seqnum_block_allocate(void)
{
    if (!m_seqnum_allocation_in_progress)
    {
        uint32_t next_block = m_net_state.seqnum_max_available + NETWORK_SEQNUM_FLASH_BLOCK_SIZE;
        if (next_block <= NETWORK_SEQNUM_MAX + 1)
        {
#if MESH_EXTERNAL_PERSISTENT_STORAGE != 1
            fm_entry_t * p_new_entry = flash_manager_entry_alloc(&m_flash_manager, FLASH_HANDLE_SEQNUM, sizeof(net_flash_data_sequence_number_t));
            if (p_new_entry == NULL)
            {
                /* try again later */
                static fm_mem_listener_t mem_listener = {.callback = flash_mem_available,
                                                        .p_args = seqnum_block_allocate};
                flash_manager_mem_listener_register(&mem_listener);
            }
            else
            {
                p_new_entry->data[0] = next_block;
                m_seqnum_allocation_in_progress = true;
                flash_manager_entry_commit(p_new_entry);
            }
#else
            m_seqnum_allocation_in_progress = true;
            m_storage_write_cb(FLASH_HANDLE_SEQNUM, &next_block, sizeof(next_block));
#endif
        }
    }
}

static void flash_store_iv_index(void)
{
#if MESH_EXTERNAL_PERSISTENT_STORAGE != 1
    fm_entry_t * p_new_entry = flash_manager_entry_alloc(&m_flash_manager, FLASH_HANDLE_IV_INDEX, sizeof(net_flash_data_iv_index_t));
    if (p_new_entry == NULL)
    {
        /* try again later */
        static fm_mem_listener_t mem_listener = {.callback = flash_mem_available,
                                                    .p_args = flash_store_iv_index};
        flash_manager_mem_listener_register(&mem_listener);
    }
    else
    {
        net_flash_data_iv_index_t * p_iv_index_data = (net_flash_data_iv_index_t *) p_new_entry->data;
        p_iv_index_data->iv_index = m_net_state.iv_index;
        p_iv_index_data->iv_update_in_progress = m_net_state.iv_update.state;

        flash_manager_entry_commit(p_new_entry);
    }
#else
    net_flash_data_iv_index_t iv_index_data;
    iv_index_data.iv_index = m_net_state.iv_index;
    iv_index_data.iv_update_in_progress = m_net_state.iv_update.state;

    m_storage_write_cb(FLASH_HANDLE_IV_INDEX, &iv_index_data, sizeof(iv_index_data));
#endif
}

#if MESH_EXTERNAL_PERSISTENT_STORAGE != 1
static void flash_write_complete(const flash_manager_t * p_manager,
                                 const fm_entry_t * p_entry,
                                 fm_result_t result)
{

    if (result == FM_RESULT_SUCCESS)
    {
        if (p_entry->header.handle == FLASH_HANDLE_SEQNUM)
        {
            NRF_MESH_ASSERT(m_seqnum_allocation_in_progress);
            m_net_state.seqnum_max_available = p_entry->data[0];
            m_seqnum_allocation_in_progress = false;
        }
    }
    else
    {
        NRF_MESH_ASSERT(result == FM_RESULT_ERROR_FLASH_MALFUNCTION);
        nrf_mesh_evt_t evt =
        {
            .type = NRF_MESH_EVT_FLASH_FAILED,
            .params.flash_failed.user = NRF_MESH_FLASH_USER_CORE,
            .params.flash_failed.p_flash_entry = p_entry,
            .params.flash_failed.p_flash_page = NULL,
            .params.flash_failed.p_area = m_flash_manager.config.p_area,
            .params.flash_failed.page_count = m_flash_manager.config.page_count,
        };
        event_handle(&evt);
    }
}
#else
void net_state_ext_write_done(uint16_t handle, void* data_ptr, uint16_t data_size) {
    if (handle == FLASH_HANDLE_SEQNUM) {
        NRF_MESH_ASSERT(m_seqnum_allocation_in_progress);
        m_net_state.seqnum_max_available = ((uint32_t*)data_ptr)[0];
        m_seqnum_allocation_in_progress = false;
    }
}
#endif

static void init_flash_storage(void)
{
#if MESH_EXTERNAL_PERSISTENT_STORAGE != 1
    flash_manager_config_t config;
    memset(&config, 0, sizeof(config));
    config.min_available_space = 0;
    config.p_area = net_state_flash_area_get();
    config.page_count = NET_FLASH_PAGE_COUNT;
    config.write_complete_cb = flash_write_complete;

