crownstone/nRF5-SDK-for-Mesh/mesh/core/src/net_state.c
    if (flash_manager_add(&m_flash_manager, &config) != NRF_SUCCESS)
    {
        static fm_mem_listener_t mem_listener = {.callback = flash_mem_available,
                                                 .p_args = init_flash_storage};
        flash_manager_mem_listener_register(&mem_listener);
    }
#endif
}

#if MESH_EXTERNAL_PERSISTENT_STORAGE != 1
static fm_iterate_action_t entry_recover_cb(const fm_entry_t * p_entry, void * p_args)
{
    entry_recover_context_t * p_context = p_args;
    switch (p_entry->header.handle)
    {
        case FLASH_HANDLE_IV_INDEX:
            p_context->p_iv_index_data = (const net_flash_data_iv_index_t *) p_entry->data;
            break;
        case FLASH_HANDLE_SEQNUM:
            p_context->p_seqnum_data = (const net_flash_data_sequence_number_t *) p_entry->data;
            break;
        default:
            break;
    }
    return FM_ITERATE_ACTION_CONTINUE;
}
#endif

void net_state_recover_from_flash(void)
{
    bearer_event_critical_section_begin();
#if MESH_EXTERNAL_PERSISTENT_STORAGE != 1
    entry_recover_context_t context = {NULL, NULL};
    (void) flash_manager_entries_read(&m_flash_manager, NULL, entry_recover_cb, &context);

    if (context.p_iv_index_data == NULL || context.p_seqnum_data == NULL)
    {
        /* Need both data types to consider the storage valid. Reset state and flash both. */
        m_net_state.seqnum = 0;
        m_net_state.iv_index = 0;
        m_net_state.iv_update.state = NET_STATE_IV_UPDATE_NORMAL;
        flash_store_iv_index();
    }
    else
    {
        m_net_state.iv_index = context.p_iv_index_data->iv_index;
        m_net_state.iv_update.state = (net_state_iv_update_t) context.p_iv_index_data->iv_update_in_progress;

        if (((const void *) context.p_seqnum_data < (const void *) context.p_iv_index_data) && !context.p_iv_index_data->iv_update_in_progress)
        {
            /* At the end of the IV update state, we always flash the IV index data first, then flash
            * the sequence number after. If we found the sequence number entry before the IV index
            * entry that marked the end of the IV update procedure, we should reset the sequence
            * number, as it means we failed to flash the new sequence number after an IV update.
            */
            m_net_state.seqnum = 0;
        }
        else
        {
            m_net_state.seqnum = *context.p_seqnum_data;
        }
    }
#else
    net_flash_data_iv_index_t iv_index_data;
    uint32_t ret_code_iv = m_storage_read_cb(FLASH_HANDLE_IV_INDEX, &iv_index_data, sizeof(iv_index_data));

    net_flash_data_sequence_number_t seqnum_data;
    uint32_t ret_code_seq = m_storage_read_cb(FLASH_HANDLE_SEQNUM, &seqnum_data, sizeof(seqnum_data));
    if (ret_code_iv != NRF_SUCCESS || ret_code_seq != NRF_SUCCESS)
    {
        /* Need both data types to consider the storage valid. Reset state and flash both. */
        m_net_state.seqnum = 0;
        m_net_state.iv_index = 0;
        m_net_state.iv_update.state = NET_STATE_IV_UPDATE_NORMAL;
        flash_store_iv_index();
    }
    else
    {
        m_net_state.iv_index = iv_index_data.iv_index;
        m_net_state.iv_update.state = (net_state_iv_update_t) iv_index_data.iv_update_in_progress;
        m_net_state.seqnum = seqnum_data;
    }
#endif

    /* Regardless of flash contents, we must allocate the next block of sequence numbers before we
     * start sending. We set the seqnum max to the seqnum, and trigger the allocation, so no
     * sequence numbers are spent before we get the allocation stored. */
    m_net_state.seqnum_max_available = m_net_state.seqnum;
    seqnum_block_allocate();
    bearer_event_critical_section_end();
}

void net_state_reset(void)
{
#if MESH_EXTERNAL_PERSISTENT_STORAGE != 1
    if (flash_manager_entry_invalidate(&m_flash_manager, FLASH_HANDLE_SEQNUM) == NRF_SUCCESS &&
        flash_manager_entry_invalidate(&m_flash_manager, FLASH_HANDLE_IV_INDEX) == NRF_SUCCESS)
    {
        memset(&m_net_state, 0, sizeof(m_net_state));
        m_iv_state_set = false;
    }
    else
    {
        /* try again later */
        static fm_mem_listener_t mem_listener = {.callback = flash_mem_available,
                                                 .p_args = net_state_reset};
        flash_manager_mem_listener_register(&mem_listener);
    }
#else
    m_storage_erase_cb(FLASH_HANDLE_SEQNUM);
    m_storage_erase_cb(FLASH_HANDLE_IV_INDEX);
    memset(&m_net_state, 0, sizeof(m_net_state));
    m_iv_state_set = false;
#endif
    seqnum_block_allocate();
}

const void * net_state_flash_area_get(void)
{
#if MESH_EXTERNAL_PERSISTENT_STORAGE != 1
#ifdef NET_FLASH_AREA_LOCATION
    return (const void *) NET_FLASH_AREA_LOCATION;
#else
    /* Default to putting the area directly before the recovery page */
    return (((const uint8_t *) flash_manager_recovery_page_get()) - (NET_FLASH_PAGE_COUNT * PAGE_SIZE));
#endif
#else
    return 0;
#endif
}

#else /* PERSISTENT_STORAGE*/
static void flash_store_iv_index(void)
{

}
static void seqnum_block_allocate(void)
{

}
void net_state_recover_from_flash(void)
{
}
void net_state_reset(void)
{
    memset(&m_net_state, 0, sizeof(m_net_state));
    m_iv_state_set = false;
    RESET_SEQNUM_MAX();
}
const void * net_state_flash_area_get(void)
{
    return 0;
}
#endif /* PERSISTENT_STORAGE*/

/*****************************************************************************
* Interface functions
*****************************************************************************/
void net_state_init(void)
{
    memset(&m_net_state, 0, sizeof(m_net_state));
    m_iv_update_timer.timestamp = timer_now();
    m_iv_update_timer.cb = iv_update_timer_handler;
    m_iv_update_timer.interval = NETWORK_IV_UPDATE_TIMER_INTERVAL_US;
    m_iv_update_timer.p_context = 0;
    m_iv_update_timer.p_next = NULL;
    m_test_mode = false;

#if PERSISTENT_STORAGE || MESH_EXTERNAL_PERSISTENT_STORAGE
    init_flash_storage();
#else
    RESET_SEQNUM_MAX();
#endif
}

void net_state_enable(void)
{
    if (!m_enabled)
    {
        m_mesh_evt_handler.evt_cb = mesh_evt_handler;
        nrf_mesh_evt_handler_add(&m_mesh_evt_handler);
        timer_sch_schedule(&m_iv_update_timer);
        m_enabled = true;
    }
}

