crownstone/nRF5-SDK-for-Mesh/mesh/core/src/net_state.c
uint32_t net_state_seqnum_alloc(uint32_t * p_seqnum)
{
    if (m_net_state.seqnum < m_net_state.seqnum_max_available)
    {
        /* Check if we've reached the seqnum threshold for a state transition. */
        uint32_t threshold = NETWORK_SEQNUM_IV_UPDATE_START_THRESHOLD;
        if (m_net_state.iv_update.state == NET_STATE_IV_UPDATE_IN_PROGRESS)
        {
            threshold = NETWORK_SEQNUM_IV_UPDATE_END_THRESHOLD;
        }
        bool ivu_triggered = false;
        if (m_net_state.seqnum >= threshold)
        {
            m_net_state.iv_update.pending = true;
            ivu_triggered = iv_update_trigger_if_pending();
        }

        if (!ivu_triggered && m_net_state.seqnum >= m_net_state.seqnum_max_available - NETWORK_SEQNUM_FLASH_BLOCK_THRESHOLD)
        {
            seqnum_block_allocate();
        }
        /* Get the sequence number after doing the state updates, as they might
         * trigger changes to it. */
        uint32_t was_masked;
        _DISABLE_IRQS(was_masked);
        *p_seqnum = m_net_state.seqnum++;
        _ENABLE_IRQS(was_masked);

        return NRF_SUCCESS;
    }
    else
    {
        seqnum_block_allocate();
        return NRF_ERROR_FORBIDDEN;
    }
}

uint32_t net_state_iv_update_start(void)
{
    uint32_t status;
    bearer_event_critical_section_begin();
    if (m_net_state.iv_update.state == NET_STATE_IV_UPDATE_NORMAL &&
        !m_net_state.iv_update.locked &&
        iv_timeout_limit_passed(m_net_state.iv_update.timeout_counter))
    {
        m_net_state.iv_update.state = NET_STATE_IV_UPDATE_IN_PROGRESS;
        m_net_state.iv_update.timeout_counter = 0;
        m_net_state.iv_index = m_net_state.iv_index + 1;
        flash_store_iv_index();
        iv_index_notify(NULL);
        status = NRF_SUCCESS;
    }
    else
    {
        status = NRF_ERROR_INVALID_STATE;
    }
    bearer_event_critical_section_end();
    return status;
}

void net_state_iv_update_test_mode_set(bool test_mode_on)
{
    m_test_mode = test_mode_on;
}

uint32_t net_state_test_mode_transition_run(net_state_iv_update_signals_t signal)
{
    if ((signal == NET_STATE_TO_IV_UPDATE_IN_PROGRESS_SIGNAL &&
         m_net_state.iv_update.state == NET_STATE_IV_UPDATE_IN_PROGRESS) ||
        (signal == NET_STATE_TO_NORMAL_SIGNAL &&
         m_net_state.iv_update.state == NET_STATE_IV_UPDATE_NORMAL))
    {
        return NRF_ERROR_FORBIDDEN;
    }

    m_net_state.iv_update.pending = true;
    (void) iv_update_trigger_if_pending();

    return NRF_SUCCESS;
}

void net_state_iv_index_lock(bool lock)
{
    static uint32_t lock_count = 0;
    if (lock)
    {
        m_net_state.iv_update.locked = true;
        lock_count++;
    }
    else
    {
        NRF_MESH_ASSERT(lock_count > 0);
        lock_count--;
        if (lock_count == 0)
        {
            m_net_state.iv_update.locked = false;
            (void) iv_update_trigger_if_pending();
        }
    }
}

void net_state_key_refresh_phase_changed(uint16_t subnet_index, const uint8_t * p_network_id, nrf_mesh_key_refresh_phase_t new_phase)
{
    nrf_mesh_evt_t app_event;
    app_event.params.key_refresh.subnet_index = subnet_index;
    app_event.params.key_refresh.phase = new_phase;
    app_event.params.key_refresh.p_network_id = p_network_id;
    app_event.type = NRF_MESH_EVT_KEY_REFRESH_NOTIFICATION;
    event_handle(&app_event);
}

uint32_t net_state_beacon_iv_index_get(void)
{
    return m_net_state.iv_index;
}

uint32_t net_state_tx_iv_index_get(void)
{
    /* While an IV update is in progress, we should transmit on the previous IV
     * index. */
    if (m_net_state.iv_update.state == NET_STATE_IV_UPDATE_IN_PROGRESS)
    {
        return m_net_state.iv_index - 1;
    }
    else
    {
        return m_net_state.iv_index;
    }
}

uint32_t net_state_rx_iv_index_get(uint8_t ivi)
{
    /* Always receive on the current IV index and the previous. Compare the lsb
     * to determine which of the two the given ivi belongs to. */
    if ((m_net_state.iv_index & NETWORK_IVI_MASK) != (ivi & 0x01))
    {
        return (m_net_state.iv_index - 1);
    }
    else
    {
        return m_net_state.iv_index;
    }
}

net_state_iv_update_t net_state_iv_update_get(void)
{
    return m_net_state.iv_update.state;
}

uint32_t net_state_iv_index_set(uint32_t iv_index, bool iv_update)
{
    if (m_iv_state_set)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    else
    {
        m_iv_state_set = true;
        m_net_state.iv_index = iv_index;
        m_net_state.iv_update.state =
            iv_update ? NET_STATE_IV_UPDATE_IN_PROGRESS : NET_STATE_IV_UPDATE_NORMAL;
        flash_store_iv_index();
        iv_index_notify(NULL);

        /* Force reseting of sequence numbers upon IV index set */
        m_net_state.seqnum = 0;
        RESET_SEQNUM_MAX();
        seqnum_block_allocate();

        return NRF_SUCCESS;
    }
}

#if MESH_EXTERNAL_PERSISTENT_STORAGE
void net_state_register_ext_storage_write_cb(net_state_storage_write storage_write_cb) {
    m_storage_write_cb = storage_write_cb;
}

void net_state_register_ext_storage_read_cb(net_state_storage_read storage_read_cb) {
    m_storage_read_cb = storage_read_cb;
}

void net_state_register_ext_storage_erase_cb(net_state_storage_erase storage_erase_cb) {
	m_storage_erase_cb = storage_erase_cb;
}
#endif

